Revit 2024 API
BuiltInFailures.AutoRouteFailures.NotAllPartsWereConvertedPlaceholdersWereAddedWarning Property
 Not all parts were converted. Placeholders were added to fill the gaps. Check the fabrication service definition for the system.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId NotAllPartsWereConvertedPlaceholdersWereAddedWarning { get; }
Visual Basic
Public Shared ReadOnly Property NotAllPartsWereConvertedPlaceholdersWereAddedWarning As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ NotAllPartsWereConvertedPlaceholdersWereAddedWarning {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.AutoRouteFailures Class
Autodesk.Revit.DB Namespace